{"class_name": "Model", "keras_version": "2.2.4-tf", "config": {"layers": [{"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 20], "name": "input", "sparse": false}, "inbound_nodes": [], "name": "input"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "name": "hidden1", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "units": 32, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["input", 0, 0, {}]]], "name": "hidden1"}, {"class_name": "LeakyReLU", "config": {"dtype": "float32", "trainable": true, "name": "LeakyReLU1_.1", "alpha": 0.10000000149011612}, "inbound_nodes": [[["hidden1", 0, 0, {}]]], "name": "LeakyReLU1_.1"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "name": "hidden2", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "units": 64, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["LeakyReLU1_.1", 0, 0, {}]]], "name": "hidden2"}, {"class_name": "LeakyReLU", "config": {"dtype": "float32", "trainable": true, "name": "LeakyReLU2_.1", "alpha": 0.10000000149011612}, "inbound_nodes": [[["hidden2", 0, 0, {}]]], "name": "LeakyReLU2_.1"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "name": "output", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "sigmoid", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "units": 4, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["LeakyReLU2_.1", 0, 0, {}]]], "name": "output"}], "input_layers": [["input", 0, 0]], "output_layers": [["output", 0, 0]], "name": "model"}, "backend": "tensorflow"}